Revit 2024 API
ElectricalSystem.PolesNumber Property
 The Poles Number of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public int PolesNumber { get; }
Visual Basic
Public ReadOnly Property PolesNumber As Integer
	Get
Visual C++
public:
property int PolesNumber {
	int get ();
}
Remarks
 This property is used to retrieve the Poles Number of the Electrical System.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This property only available when System Type is Power!
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace